In [1]:
import numpy as np
import pandas as pd

In [2]:
banks = pd.read_csv('../03-General Pandas/Pandas-Exercises/banklist.csv')

In [3]:
banks.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

In [4]:
banks.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

In [5]:
banks.ST.nunique()

44

In [6]:
banks.ST.unique()

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

In [7]:
banks.groupby('ST').count().sort_values('Bank Name', 
                                        ascending=False).iloc[:5]['City']

ST
GA    93
FL    75
IL    67
CA    41
MN    23
Name: City, dtype: int64

In [8]:
banks['Acquiring Institution'].value_counts().iloc[:6]

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Community & Southern Bank               8
Name: Acquiring Institution, dtype: int64

In [9]:
banks[banks['Acquiring Institution'] == 'State Bank of Texas']

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

In [10]:
banks[banks['ST']=='CA']['City'].value_counts().iloc[:5]

Los Angeles      4
San Diego        2
La Jolla         2
Palm Desert      2
San Francisco    2
Name: City, dtype: int64

In [11]:
banks['Bank Name'].apply(lambda name: 'Bank' not in name).sum()

14

In [12]:
banks['Bank Name'].apply(lambda name: name.upper()[0] == 'S').sum()

53

In [13]:
sum(banks['CERT'] > 20000)

417

In [14]:
banks['Bank Name'].apply(lambda name: len(name.split()) == 2).sum()

114

In [15]:
banks['Closing Date'].apply(lambda date: date[-2:] == '08').sum()

25

In [16]:
pd.to_datetime(banks['Closing Date']).apply(lambda date: date.year == 2008).sum()

25